result of running terraform plan:

`helenl1@artful-machine:~/work/mina/coda-automation/terraform/testnets/ci-net$ /home/helenl1/work/terraform_0.12.29_linux_386/terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ci_testnet.data.local_file.genesis_ledger will be read during apply
  # (config refers to values not yet known)
 <= data "local_file" "genesis_ledger"  {
      + content        = (known after apply)
      + content_base64 = (known after apply)
      + filename       = "genesis_ledger.json"
      + id             = (known after apply)
    }

  # module.ci_testnet.helm_release.archive_node[0] will be created
  + resource "helm_release" "archive_node" {
      + atomic                     = false
      + chart                      = "archive-node"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "archive-node-1"
      + namespace                  = "ci-net"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://coda-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.4.3"
      + wait                       = false
    }

  # module.ci_testnet.helm_release.archive_node[1] will be created
  + resource "helm_release" "archive_node" {
      + atomic                     = false
      + chart                      = "archive-node"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "archive-node-2"
      + namespace                  = "ci-net"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://coda-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.4.3"
      + wait                       = false
    }

  # module.ci_testnet.helm_release.block_producers will be created
  + resource "helm_release" "block_producers" {
      + atomic                     = false
      + chart                      = "block-producer"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ci-net-block-producers"
      + namespace                  = "ci-net"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://coda-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.4.3"
      + wait                       = false
    }

  # module.ci_testnet.helm_release.seed will be created
  + resource "helm_release" "seed" {
      + atomic                     = false
      + chart                      = "seed-node"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ci-net-seed"
      + namespace                  = "ci-net"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://coda-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.4.3"
      + wait                       = false
    }

  # module.ci_testnet.helm_release.snark_workers will be created
  + resource "helm_release" "snark_workers" {
      + atomic                     = false
      + chart                      = "snark-worker"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ci-net-snark-worker"
      + namespace                  = "ci-net"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://coda-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.4.3"
      + wait                       = false
    }

  # module.ci_testnet.kubernetes_namespace.testnet_namespace will be created
  + resource "kubernetes_namespace" "testnet_namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ci-net"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ci_testnet.kubernetes_role_binding.helm_release will be created
  + resource "kubernetes_role_binding" "helm_release" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "admin-role"
          + namespace        = "ci-net"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "default"
          + namespace = "ci-net"
        }
    }

  # module.ci_testnet.null_resource.block_producer_key_generation will be created
  + resource "null_resource" "block_producer_key_generation" {
      + id = (known after apply)
    }

  # module.ci_testnet.null_resource.block_producer_uploads will be created
  + resource "null_resource" "block_producer_uploads" {
      + id = (known after apply)
    }

  # module.ci_testnet.null_resource.prepare_keys_for_deployment will be created
  + resource "null_resource" "prepare_keys_for_deployment" {
      + id = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.`